# 1,2,3 더하기 (9095)

# 점화식 규칙
def dp(n):
    if n == 1:
        return 1
    elif n == 2:
        return 2
    elif n == 3:
        return 4
    else:
        return dp(n-1)+dp(n-2)+dp(n-3)

# n=1 -> 1개 (1)
# n=2 -> 2개 (1+1, 2)
# n=3 -> 4개 (3, 2+1, 1+2, 1+1+1+1)
# n=4 -> 7개 (3+1, 1+3, 2+2, 2+1+1, 1+2+1, 1+1+2, 1+1+1+1)
# n=5 -> 13개 (3+2, 2+3, 3+1+1, 1+3+1, 1+1+3, 2+2+1, 2+1+2, 1+2+2, 2+1+1+1, 1+2+1+1, 1+1+2+1, 1+1+1+2, 1+1+1+1+1)
# ..
# dp(n) = dp(n-1) + dp(n-2) + dp(n-3)


# 테스트케이스 개수 T
T = int(input())

# 정수n (1~10) T번 입력받고 출력
for i in range(T):
    n = int(input())
    print(dp(n))
